# Projeto de consulta de dados a uma base do ifood
- Os dados utilizados neste projeto podem ser encontrados no link a seguir
      
  https://www.kaggle.com/datasets/ricardotachinardi/ifood-restaurants-data

- Realizarei duas vezes cada um dos procedimentos, para demonstrar duas das possíveis formas de se trabalhar com SQL no python

In [1]:
# Impotando as bibliotecas necessárias
import pandas as pd
import pandasql as ps
from sqlalchemy import create_engine
import psycopg2 
import warnings
warnings.filterwarnings("ignore") # Vai nos ajudar a evitar alguns avisos irrelevantes nesse momento

# Carregando a Base de dados

In [2]:
# Carregando a Base de dados para o Python
ifood = pd.read_csv("ifood-restaurants-february-2021.csv")

# Visualizando as primeiras linhas (com pandassql)
ps.sqldf("SELECT * FROM ifood limit 2")

,availableForScheduling,avatar,category,delivery_fee,delivery_time,distance,ibge,minimumOrderValue,name,paymentCodes,price_range,rating,tags,url
0,0,https://static-images.ifood.com.br/image/uploa...,Marmita,3.99,27,1.22,5300108,10.0,Cantina Arte & Sabor,DNR $$ MPAY $$ MOVPAY_MC $$ MC $$ GPY_ELO $$ E...,CHEAPEST,0.0,ADDRESS_PREFORM_TYPE $$ CART::MCHT::100_DELIVE...,https://www.ifood.com.br/delivery/brasilia-df/...
1,0,https://static-images.ifood.com.br/image/uploa...,Açaí,7.99,61,4.96,5300108,10.0,Raruty Açaí Raiz,DNR $$ MPAY $$ MOVPAY_MC $$ MC $$ GPY_ELO $$ E...,CHEAPEST,0.0,ADDRESS_PREFORM_TYPE $$ GUIDED_HELP_TYPE $$ ME...,https://www.ifood.com.br/delivery/brasilia-df/...

# Persistindo os dados no postgres

In [3]:
# Persistindo os dados no postgress 
# Como o objetivo é somente realizar algumas consultas, não iremos realizar o tratamento agora
engine = create_engine('postgresql://postgres:123456@localhost:5432/modulo_3')
ifood.to_sql('ifood_dados', engine)

# Criando conexão com o postgres para relaizar consultas

In [4]:
# Usando conexão com postgres para fazer consulta (com psycopg2)
SGBD = "postgresql+psycopg2"
USER = "postgres"
SENHA = "123456"
HOST = "localhost"  
DATABASE = "modulo_3"
PORT = 5432
conexao_string = f"host={HOST} port={PORT} dbname={DATABASE} user={USER} password={SENHA}"

conexao = psycopg2.connect(conexao_string)
query = "select * from ifood_dados limit 1"
pd.read_sql(query,conexao)

,index,availableForScheduling,avatar,category,delivery_fee,delivery_time,distance,ibge,minimumOrderValue,name,paymentCodes,price_range,rating,tags,url
0,0,False,https://static-images.ifood.com.br/image/uploa...,Marmita,3.99,27,1.22,5300108,10.0,Cantina Arte & Sabor,DNR $$ MPAY $$ MOVPAY_MC $$ MC $$ GPY_ELO $$ E...,CHEAPEST,0.0,ADDRESS_PREFORM_TYPE $$ CART::MCHT::100_DELIVE...,https://www.ifood.com.br/delivery/brasilia-df/...

# Análise descritiva

In [19]:
# Tipo de dados das colunas (Consultando Diretamente do Banco)
query = """SELECT
            data_type,
            column_name
        FROM
            information_schema.columns
        WHERE table_name = 'ifood_dados'"""
pd.read_sql(query,conexao)

           data_type             column_name
0             bigint                   index
1            boolean  availableForScheduling
2               text                  avatar
3               text                category
4   double precision            delivery_fee
5             bigint           delivery_time
6   double precision                distance
7             bigint                    ibge
8   double precision       minimumOrderValue
9               text                    name
10              text            paymentCodes
11              text             price_range
12  double precision                  rating
13              text                    tags
14              text                     url

In [6]:
# Tipo de dados das colunas (Consultando do Dataframe)
for i in ifood.columns:
    display(ps.sqldf(f"SELECT DISTINCT typeof({i}) FROM ifood"))

  typeof(availableForScheduling)
0                        integer

  typeof(avatar)
0           text
1           null

  typeof(category)
0             text

  typeof(delivery_fee)
0                 real

  typeof(delivery_time)
0               integer

  typeof(distance)
0             real

  typeof(ibge)
0      integer

  typeof(minimumOrderValue)
0                      real

  typeof(name)
0         text

  typeof(paymentCodes)
0                 text
1                 null

  typeof(price_range)
0                text

  typeof(rating)
0           real

  typeof(tags)
0         text

  typeof(url)
0        text

In [20]:
# Contagem de nulos/não nulos (Consultando Diretamente do Banco)
query = """SELECT 
                count(index)-count(*) as index,
                count("availableForScheduling")-count(*) as availableForScheduling,
                count(avatar)-count(*) as avatar,
                count(category)-count(*) as category,
                count(delivery_fee)-count(*) as delivery_fee,
                count(delivery_time)-count(*) as delivery_time,
                count(distance)-count(*) as distance,
                count(ibge)-count(*) as ibge,
                count("minimumOrderValue")-count(*) as minimumOrderValue,
                count(name)-count(*) as name,
                count("paymentCodes")-count(*) as paymentCodes,
                count("price_range")-count(*) as price_range,
                count(rating)-count(*) as rating,
                count(tags)-count(*) as tags,
                count(url)-count(*) as url
            FROM public.ifood_dados"""
pd.read_sql(query,conexao)

,index,availableforscheduling,avatar,category,delivery_fee,delivery_time,distance,ibge,minimumordervalue,name,paymentcodes,price_range,rating,tags,url
0,0,0,-277,0,0,0,0,0,0,0,-2,0,0,0,0

In [50]:
# Contagem de nulos/não nulos (Consultando do Dataframe)
for i in ifood.columns:
    print(i)
    display(ps.sqldf( f"""
                    SELECT 
                        SUM(CASE WHEN {i} IS NULL THEN 1 ELSE 0 END) as nulos
                        , SUM(CASE WHEN {i} IS NULL THEN 0 ELSE 1 END) as 'não nulos'
                    FROM ifood
               ;"""
    ))

availableForScheduling

   nulos  não nulos
0      0     406399

avatar

   nulos  não nulos
0    277     406122

category

   nulos  não nulos
0      0     406399

delivery_fee

   nulos  não nulos
0      0     406399

delivery_time

   nulos  não nulos
0      0     406399

distance

   nulos  não nulos
0      0     406399

ibge

   nulos  não nulos
0      0     406399

minimumOrderValue

   nulos  não nulos
0      0     406399

name

   nulos  não nulos
0      0     406399

paymentCodes

   nulos  não nulos
0      2     406397

price_range

   nulos  não nulos
0      0     406399

rating

   nulos  não nulos
0      0     406399

tags

   nulos  não nulos
0      0     406399

url

   nulos  não nulos
0      0     406399

In [8]:
# Valores distintos em cada coluna (Consultando Diretamente do Banco)

query = """ 
                SELECT 
                count(DISTINCT index) as index,
                count(DISTINCT"availableForScheduling") as availableForScheduling,
                count(DISTINCT avatar) as avatar,
                count(DISTINCT category) as category,
                count(DISTINCT delivery_fee)as delivery_fee,
                count(DISTINCT delivery_time) as delivery_time,
                count(DISTINCT distance) as distance,
                count(DISTINCT ibge) as ibge,
                count(DISTINCT "minimumOrderValue") as minimumOrderValue,
                count(DISTINCT name) as name,
                count(DISTINCT "paymentCodes") as paymentCodes,
                count(DISTINCT "price_range") as price_range,
                count(DISTINCT rating) as rating,
                count(DISTINCT tags) as tags,
                count(DISTINCT url) as url
            FROM public.ifood_dados


"""

pd.read_sql(query,conexao)

,index,availableforscheduling,avatar,category,delivery_fee,delivery_time,distance,ibge,minimumordervalue,name,paymentcodes,price_range,rating,tags,url
0,406399,2,406116,61,406,190,1770,1478,595,345846,18376,5,22471,118660,406399

In [11]:
# Valores distintos em cada coluna (Consultando do Dataframe)
for i in ifood.columns:
    display(ps.sqldf(f"""
                    SELECT 
                        COUNT(DISTINCT {i})
                    FROM ifood
               """))

   COUNT(DISTINCT availableForScheduling)
0                                       2

   COUNT(DISTINCT avatar)
0                  406116

   COUNT(DISTINCT category)
0                        61

   COUNT(DISTINCT delivery_fee)
0                           406

   COUNT(DISTINCT delivery_time)
0                            190

   COUNT(DISTINCT distance)
0                      1770

   COUNT(DISTINCT ibge)
0                  1478

   COUNT(DISTINCT minimumOrderValue)
0                                595

   COUNT(DISTINCT name)
0                345846

   COUNT(DISTINCT paymentCodes)
0                         18376

   COUNT(DISTINCT price_range)
0                            5

   COUNT(DISTINCT rating)
0                   22471

   COUNT(DISTINCT tags)
0                118660

   COUNT(DISTINCT url)
0               406399

# Respondendo perguntas com os dados da base

In [9]:
# Pegunta 1: Qual categoria mais aparece na base? (Consultando Diretamente do Banco)
query = """ SELECT 
                category as Categoria,
                COUNT(category) AS Contagem
            FROM public.ifood_dados
            GROUP BY category
            ORDER BY contagem DESC
            LIMIT 1
"""

pd.read_sql(query, conexao)

  categoria  contagem
0   Lanches     98946

In [12]:
# Pegunta 1: Qual categoria mais aparece na base? (Consultando do Dataframe)
ps.sqldf(
""" SELECT 
        category as Categoria,
        COUNT(category) AS Contagem
    FROM ifood
    GROUP BY category
    ORDER BY contagem DESC
    LIMIT 1
"""
)

  Categoria  Contagem
0   Lanches     98946

In [10]:
# Pergunta 2: Qual a maior taxa de entrega da base? (Consultando Diretamente do Banco)
query = """ SELECT 
                MAX(delivery_fee) as "Maior taxa de entrega"
            FROM 
                public.ifood_dados
"""

pd.read_sql(query, conexao)

   Maior taxa de entrega
0                   35.0

In [13]:
# Pergunta 2: Qual a maior taxa de entrega da base? (Consultando do Dataframe)
ps.sqldf(
"""
    SELECT 
        MAX(delivery_fee) as 'Maior taxa de entrega'
    FROM 
        ifood

"""

)

   Maior taxa de entrega
0                   35.0

In [11]:
# Pergunta 3: Qual o tempo médio de entrega? (Consultando Diretamente do Banco)
query = """ 
 SELECT 
        AVG(delivery_time) as "Tempo médio de entrega"
    FROM 
        ifood_dados
"""

pd.read_sql(query, conexao)

   Tempo médio de entrega
0               47.432747

In [14]:
# Pergunta 3: Qual o tempo médio de entrega? (Consultando do Dataframe)
ps.sqldf(
"""
    SELECT 
        AVG(delivery_time) as 'Tempo médio de entrega'
    FROM 
        ifood
"""
)

   Tempo médio de entrega
0               47.432747

In [12]:
# Pergunta 4: Qual a média de taxa de entrega? (Consultando Diretamente do Banco)
query = """ 
    SELECT 
        AVG(delivery_fee) as "Taxa média de entrega"
    FROM 
        ifood_dados
"""

pd.read_sql(query, conexao)

   Taxa média de entrega
0               6.804577

In [15]:
# Pergunta 4: Qual a média de taxa de entrega? (Consultando do Dataframe)
ps.sqldf(
"""
    SELECT 
        AVG(delivery_fee) as 'Taxa média de entrega'
    FROM 
        ifood
"""
)

   Taxa média de entrega
0               6.804577

In [13]:
# Pergunta 5: Qual o maior valor mínimo de pedido? (Consultando Diretamente do Banco)
query = """ 
    SELECT 
        MAX("minimumOrderValue") as "Maior Pedido Mínimo"
    FROM 
        ifood_dados
"""

pd.read_sql(query, conexao)
# Aqui há uma inconsistencia e deve ser verificado se há problema com a base, a captura dos dados ou com o cadastro do restaurante

   Maior Pedido Mínimo
0          99999999.99

In [16]:
# Pergunta 5: Qual o maior valor mínimo de pedido? (Consultando do Dataframe)
ps.sqldf(
"""
    SELECT 
        MAX(minimumOrderValue) as 'Maior Pedido Mínimo'
    FROM 
        ifood
"""
) # Aqui há uma inconsistencia e deve ser verificado se há problema com a base, a captura dos dados ou com o cadastro do restaurante

   Maior Pedido Mínimo
0          99999999.99

In [14]:
# Pergunta 6: Quantos restaurantes avaliados com nota 5 existem para cada categoria e qual o total geral? (Consultando Diretamente do Banco)
query = """ 
    SELECT 
        DISTINCT category AS category,
        COUNT(rating) OVER(PARTITION BY category) AS "Restaurantes Nota 5 por categoria",
        COUNT(rating) OVER() AS "Total de Restautantes nota 5"
    FROM 
        ifood_dados
    WHERE
        rating = 5.0
"""

pd.read_sql(query, conexao)

,category,Restaurantes Nota 5 por categoria,Total de Restautantes nota 5
0,Asiática,19,49296
1,Contemporânea,52,49296
2,Mexicana,60,49296
3,Conveniência,773,49296
4,Mineira,27,49296
5,Cafeteria,507,49296
6,Colombiana,4,49296
7,Coreana,5,49296
8,Árabe,207,49296
9,Vegetariana,106,49296
10,Peixes,79,49296
11,Bebidas,3439,49296
12,Chinesa,143,49296
13,Pastel,730,49296
14,Mercado,559,49296
15,Yakisoba,16,49296
16,Salgados,1236,49296
17,Lanches,11721,49296
18,Frangos,76,49296
19,Frutos Do Mar,98,49296
20,Africana,6,49296
21,Alemã,15,49296
22,Cozinha Rápida,270,49296
23,Panqueca,23,49296
24,Baiana,21,49296
25,Carnes,864,49296
26,Xis,9,49296
27,Argentina,30,49296
28,Espanhola,7,49296
29,Saudável,1297,49296
30,Típica do Norte,2,49296
31,Crepe,22,49296
32,Japonesa,984,49296
33,Nordestina,32,49296
34,Hambúrguer,1055,49296
35,Vegana,125,49296
36,Sorvetes,1059,49296
37,Portuguesa,29,49296
38,Peruana,14,49296
39,Padaria,387,49296
40,Gaúcha,9,49296
41,Variada,450,49296
42,Açaí,3359,49296
43,Brasileira,6321,49296
44,Sopas & Caldos,30,49296
45,Italiana,636,49296
46,Presentes,32,49296
47,Tapioca,40,49296
48,Tailandesa,7,49296
49,Marmita,1458,49296
50,Doces & Bolos,7442,49296
51,Indiana,8,49296
52,Congelados Fit,30,49296
53,Francesa,51,49296
54,Mediterrânea,14,49296
55,Casa de Sucos,70,49296
56,Pizza,2881,49296
57,Congelados,350,49296

In [17]:
# Pergunta 6: Quantos restaurantes avaliados com nota 5 existem para cada categoria e qual o total geral? (Consultando do Dataframe)
ps.sqldf(
"""
    SELECT 
        DISTINCT category AS category,
        COUNT(rating) OVER(PARTITION BY category) AS 'Restaurantes Nota 5 por categoria',
        COUNT(rating) OVER() AS 'Total de Restautantes nota 5'
    FROM 
        ifood
    WHERE
        rating = 5.0
         
"""
)

,category,Restaurantes Nota 5 por categoria,Total de Restautantes nota 5
0,Africana,6,49296
1,Alemã,15,49296
2,Argentina,30,49296
3,Asiática,19,49296
4,Açaí,3359,49296
5,Baiana,21,49296
6,Bebidas,3439,49296
7,Brasileira,6321,49296
8,Cafeteria,507,49296
9,Carnes,864,49296
10,Casa de Sucos,70,49296
11,Chinesa,143,49296
12,Colombiana,4,49296
13,Congelados,350,49296
14,Congelados Fit,30,49296
15,Contemporânea,52,49296
16,Conveniência,773,49296
17,Coreana,5,49296
18,Cozinha Rápida,270,49296
19,Crepe,22,49296
20,Doces & Bolos,7442,49296
21,Espanhola,7,49296
22,Francesa,51,49296
23,Frangos,76,49296
24,Frutos Do Mar,98,49296
25,Gaúcha,9,49296
26,Hambúrguer,1055,49296
27,Indiana,8,49296
28,Italiana,636,49296
29,Japonesa,984,49296
30,Lanches,11721,49296
31,Marmita,1458,49296
32,Mediterrânea,14,49296
33,Mercado,559,49296
34,Mexicana,60,49296
35,Mineira,27,49296
36,Nordestina,32,49296
37,Padaria,387,49296
38,Panqueca,23,49296
39,Pastel,730,49296
40,Peixes,79,49296
41,Peruana,14,49296
42,Pizza,2881,49296
43,Portuguesa,29,49296
44,Presentes,32,49296
45,Salgados,1236,49296
46,Saudável,1297,49296
47,Sopas & Caldos,30,49296
48,Sorvetes,1059,49296
49,Tailandesa,7,49296
50,Tapioca,40,49296
51,Típica do Norte,2,49296
52,Variada,450,49296
53,Vegana,125,49296
54,Vegetariana,106,49296
55,Xis,9,49296
56,Yakisoba,16,49296
57,Árabe,207,49296

In [15]:
# Pergunta 7: Qual a média de notas das avaliações dos restaurantes na base (Total e por categoria)? (Consultando Diretamente do Banco)
query = """ 
    SELECT 
        DISTINCT category AS category,
        AVG(rating) OVER(PARTITION BY category) AS "Restaurantes Nota 5 por categoria",
        AVG(rating) OVER() AS "Total de Restautantes nota 5"
    FROM 
        ifood_dados
"""

pd.read_sql(query, conexao)

,category,Restaurantes Nota 5 por categoria,Total de Restautantes nota 5
0,Espanhola,1.715898,2.522241
1,Frutos Do Mar,2.948644,2.522241
2,Indiana,3.587224,2.522241
3,Crepe,2.618215,2.522241
4,Casa de Sucos,2.680009,2.522241
...,...,...,...
56,Peruana,2.558483,2.522241
57,Panqueca,2.272469,2.522241
58,Mediterrânea,2.661194,2.522241
59,Árabe,3.357087,2.522241
60,Cozinha Rápida,2.251331,2.522241

In [18]:
# Pergunta 7: Qual a média de notas das avaliações dos restaurantes na base (Total e por categoria)? (Consultando do Dataframe)
ps.sqldf(
"""
    SELECT 
        DISTINCT category AS category,
        AVG(rating) OVER(PARTITION BY category) AS 'Restaurantes Nota 5 por categoria',
        AVG(rating) OVER() AS 'Total de Restautantes nota 5'
    FROM 
        ifood      
"""
)

,category,Restaurantes Nota 5 por categoria,Total de Restautantes nota 5
0,Africana,1.628755,2.522241
1,Alemã,2.698104,2.522241
2,Argentina,1.868734,2.522241
3,Asiática,3.277633,2.522241
4,Açaí,2.932867,2.522241
...,...,...,...
56,Vegana,3.615712,2.522241
57,Vegetariana,2.849850,2.522241
58,Xis,2.758929,2.522241
59,Yakisoba,2.751846,2.522241
60,Árabe,3.357087,2.522241

In [16]:
# Pergunta 8: Os restaurantes mais bem avaliados são os mais caros ? (Consultando Diretamente do Banco)

query = """ 
SELECT 
    A.price_range AS "Classificação de Preços",
    AVG(A.rating) AS "Média das avaliações",
    B.moda
    
FROM ifood_dados AS A
INNER JOIN (
    SELECT DISTINCT ON (price_range) 
        price_range,
        rating AS moda,
        COUNT(rating) AS frequencia
    FROM ifood_dados
    GROUP BY price_range, rating
    ORDER BY price_range, COUNT(rating) DESC
) AS B ON A.price_range = B.price_range

GROUP BY A.price_range, B.moda
ORDER BY A.price_range DESC;

"""

pd.read_sql(query, conexao)

  Classificação de Preços  Média das avaliações  moda
0          MOST_EXPENSIVE              4.058625   0.0
1                MODERATE              3.671159   0.0
2               EXPENSIVE              3.815964   0.0
3                CHEAPEST              2.118592   0.0
4                   CHEAP              3.302978   0.0

In [7]:
# Pergunta 8: Os restaurantes mais bem avaliados são os mais caros ? (Consultando do Dataframe)
ps.sqldf(
"""
SELECT 
    DISTINCT A.price_range AS 'Classificação de Preços',
    AVG(A.rating) AS 'Média das avaliações',
    B.moda
    
       
FROM ifood AS A
INNER JOIN (SELECT 
            rating AS moda,
            price_range,
            COUNT(rating) AS frequencia
        FROM ifood
        GROUP BY price_range
        ORDER BY frequencia  ) AS B ON A.price_range = B.price_range

GROUP BY "Classificação de Preços"
ORDER BY "Classificação de Preços" DESC
"""
)

  Classificação de Preços  Média das avaliações  moda
0          MOST_EXPENSIVE              4.058625   0.0
1                MODERATE              3.671159   0.0
2               EXPENSIVE              3.815964   0.0
3                CHEAPEST              2.118592   0.0
4                   CHEAP              3.302978   0.0

In [17]:
# Pergunta 9: Qual categoria tem os restaurantes mais bem avaliados? (Consultando Diretamente do Banco)
query = """ 
    SELECT
        category
        , COUNT(category) as qt_r5

    FROM ifood_dados
    WHERE rating = 5.0
    GROUP BY category
    ORDER BY qt_r5 DESC
    LIMIT 10

"""

pd.read_sql(query, conexao)

        category  qt_r5
0        Lanches  11721
1  Doces & Bolos   7442
2     Brasileira   6321
3        Bebidas   3439
4           Açaí   3359
5          Pizza   2881
6        Marmita   1458
7       Saudável   1297
8       Salgados   1236
9       Sorvetes   1059

In [24]:
# Pergunta 9: Qual categoria tem os restaurantes mais bem avaliados? (Consultando do Dataframe)

ps.sqldf(
""" 
    SELECT
        category
        , COUNT(category) as qt_r5

    FROM ifood
    WHERE rating = 5.0
    GROUP BY category
    ORDER BY qt_r5 DESC
    LIMIT 10

"""
)

        category  qt_r5
0        Lanches  11721
1  Doces & Bolos   7442
2     Brasileira   6321
3        Bebidas   3439
4           Açaí   3359
5          Pizza   2881
6        Marmita   1458
7       Saudável   1297
8       Salgados   1236
9       Sorvetes   1059

In [18]:
# Pergunta 10: Qual o valor médio de entrega por km para os restaurantes que tem essa taxa? (Consultando Diretamente do Banco)
query = """ 
SELECT 
    name,
    CASE 
        WHEN tl_distancia = 0 THEN null
        ELSE tl_entrega / tl_distancia
    END AS valor_p_dist
FROM (
    SELECT 
        name,
        SUM(delivery_fee) OVER (PARTITION BY name) AS tl_entrega,
        SUM(distance) OVER (PARTITION BY name) AS tl_distancia
    FROM (
        SELECT 
            DISTINCT name,
            delivery_fee,
            distance
        FROM ifood_dados
        WHERE delivery_fee > 0
    ) AS subquery
) AS subquery
ORDER BY valor_p_dist DESC;

"""

pd.read_sql(query, conexao)

                             name  valor_p_dist
0           Floricultura Tropical           NaN
1       Boi na Brasa Churrascaria    600.000000
2                  Demelo Gourmet    500.000000
3                  Gula’s Lanches    500.000000
4            Comendoria Bom Sabor    499.000000
...                           ...           ...
354442              Acaraje Dendê      0.000913
354443    Mandacaru Restaurante -      0.000632
354444                Pub Babylon      0.000530
354445            Capitao Caverna      0.000378
354446                 Mic Burger      0.000269

[354447 rows x 2 columns]

In [32]:
# Pergunta 10: Qual o valor médio de entrega por km para os restaurantes que tem essa taxa? (Consultando do Dataframe)

ps.sqldf(
""" 
SELECT 
    name,
    CASE 
        WHEN tl_distancia = 0 THEN null
        ELSE tl_entrega / tl_distancia
    END AS valor_p_dist
FROM (
    SELECT 
        name,
        SUM(delivery_fee) OVER (PARTITION BY name) AS tl_entrega,
        SUM(distance) OVER (PARTITION BY name) AS tl_distancia
    FROM (
        SELECT 
            DISTINCT name,
            delivery_fee,
            distance
        FROM ifood
        WHERE delivery_fee > 0
    ) AS subquery
) AS subquery
ORDER BY valor_p_dist DESC;
"""
)

                             name  valor_p_dist
0       Boi na Brasa Churrascaria    600.000000
1                  Demelo Gourmet    500.000000
2                  Gula’s Lanches    500.000000
3            Comendoria Bom Sabor    499.000000
4                        Marechal    400.000000
...                           ...           ...
354442    Mandacaru Restaurante -      0.000632
354443                Pub Babylon      0.000530
354444            Capitao Caverna      0.000378
354445                 Mic Burger      0.000269
354446      Floricultura Tropical           NaN

[354447 rows x 2 columns]